Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: look at this next illustration which shows some of these groups .
af: kyk na die volgende illustrasie wat sommige van hierdie groepe wys .

source: have a look at the illustration of all these different groups .
af: kyk na die illustrasie van al die verskillende groepe .

source: why do you think the animals were put into a left group and a right groups ?
af: waarom dink jy is die diere in die linkerkantste of in die regterkantste groep geplaas ?

source: this question is meant to reinforce the learner's understanding and recognition of vertebrates and invertebrates .
af: die vraag is bedoel om 'n leerder se begrip en herkenning van gewerweldes en ongewerweldes teversterk .

source: vertebrates are divided into 5 groups what are these groups ?
af: vertebrate word in vyf groepe verdeel .

source: mammals reptiles birds amphibians and fish .
af: soogdiere reptiele vols amfibie en visse .

source: one of the birds in the illustration is our national bird which one is it ?
af: een van die vols in die illustrasie is ons nasionale vol .

source: the blue crane
af: die bloukraanvol

source: let's take a closer look at invertebrates and vertebrates .
af: kom ons bestudeer nou invertebrate en vertebrate van naderby .

source: if hydro is in a word that word generally has something to do with water !
af: indien hidro in 'n woord voorkom beteken dit gewoonlik dit het iets met water te doen !

source: invertebrates are animals that do not develop a backbone spinal column .
af: invertebrate is diere wat nie 'n endoskelet inwendige skelet van been met 'n werwelkolom in hul liggame het nie .

source: they also do not have an endoskeleton a bony skeleton inside their bodies .
af: hulle ontwikkel 'n ander soort skelet; sommiges het 'n hidroskelet terwyl ander 'n eksoskelet het .

source: look at the illustration of all the classes of animals again .
af: kyk weer na die illustrasie van die verskillende klasse diere .

source: can you find other examples of animals with no bones inside their bodies endoskeleton and with no hard outer skeleton exoskeleton ?
af: kan jy voorbeelde van diere sonder bene binne in hul liggame endoskelet en sonder 'n harde uitwendige skelet eksoskelet sien ?

source: sea sponge sea anemone jellyfish flatworms octopuses and earthworms .
af: seesponse see anemone jellievis platwurms seekatte en erdwurms

source: these soft bodied animals mostly have what we call a hydroskeleton .
af: hierdie diere met hul sagte liggame het meestal 'n hidroskelet .

source: examples of animals with a hydroskeleton are
af: voorbeelde van diere met 'n hidroskelet is

source: animals with such a body often need to live in or near water or damp soil .
af: diere met sulke liggame moet gewoonlik in of naby water of klam grond bly .

source: their skins are often thin and moist because they breathe through their skin. .
af: hulle velle is gewoonlik dun en klam omdat hulle deur hulle velle kan asemhaal .

source: hermit crabs have very soft bodies not like their other crab and crayfish family .
af: kluisenaarskrappe het baie sagte liggame anders as hul ander krap en kreeffamilie .

source: the hermit crab finds an empty shell and settles down inside it .
af: die kluisenaarskrap soek 'n le skulp en woon daarin .

source: when the crab grows too big for the shell it moves out and finds a bigger shell !
af: wanneer die krap te groot vir sy skulp word kruip hy uit en gaan soek 'n groter skulp !

source: many invertebrates have a shell or hard covering protecting their bodies .
af: baie ongewerweldes het 'n sterk harde bedekking oor hul sagte liggame .

source: this external skeleton is called an exoskeleton .
af: hierdie uitwendige skelet word 'n eksoskelet genoem .

source: can you think of any invertebrates that have exoskeletons ?
af: kan jy aan ongewerweldes dink wat eksoskelette het ?

source: have a look at the previous illustration again if you need some ideas .
af: kyk weer na die vorige illustrasie as jy idees nodig het .

source: starfish butterfly millipede crab spider
af: seesterre seekastaiings skoenlappers duisendpote krappe spinnekoppe

source: 97 of animals alive today are invertebrates! that means almost all animals are invertebrates !
af: 97 van alle hedendaagse diere is invertebrate! dit beteken dat feitlik alle diere invertebrate is !

source: insects are in an interesting group of invertebrates .
af: insekte is 'n interesssante groep invertebrate .

source: legs
af: pote

source: wings
af: vlerke

source: build a terrarium in your class for invertebrates .
af: bou 'n terrarium vir ongewerweldes in u klas .

source: a terrarium is an enclosure container or structure adapted or prepared for keeping smaller land animals esp. reptiles amphibians or terrestrial invertebrates under semi natural conditions for observation for study or as pets .
af: 'n terrarium is 'n hok houer of struktuur wat aangepas of voorberei is om kleiner landdiere veral reptiele amfibie of ongewerweldes onder semi natuurlike toestande vir waarneming ondersoeke of as troeteldiere aan te hou .

source: terrariums are typically glass fronted cases .
af: dit is gewoonlik 'n vertoonkas met 'n glasvenster met 'n lagie grond onderin .

source: safety warning some learners might be allergic to some of the animals you find .
af: veiligheidswaarskuwing sommige leerders mag dalk allergies vir sommige van die diere wees .

source: avoid bringing any potentially harmful animals such as stinging insects .
af: moenie enige diere wat dalk skadelik kan wees soos insekte wat steek klas toe bring nie .

source: vertebrates are animals that have a skeleton inside their bodies an endoskeleton .
af: gewerweldes is diere wat 'n skelet binne in hulle liggame 'n endoskelet het .

source: part of their skeleton is a backbone .
af: 'n deel van hierdie geraamte is die werwelkolom .

source: the word 'vertebrate' is closely related to the word 'vertebrae' which is what we call the individual bones that form the backbone so vertebrates have a backbone made up of vertebrae .
af: die woord vertebrate is afgelei van die woord vertebrae wat die individuele werwels van die werwelkolom beteken. vertebrate het dus 'n werwelkolom van werwels. vertebrate word in vyf kleiner groepe verdeel

source: a video about endoskeletons video
af: 'n video oor endoskelette http goo.gl i5lsz

source: vertebrates grow much larger than invertebrates because their bones grow with them and can support their muscles .
af: vertebrate kan groter as ongewerweldes word omdat hulle skelette saam met hulle groei en hul spiere kan ondersteun .

source: the following section in the caps textbook covers the animal skeletons in more detail .
af: die volgende afdeling in die kabv handboek behandel die diere se skelette in meer detail .

source: this activity practises learners' abilities to identify common features or characteristics but more so helps them appreciate that learning can happen within an interdependent community of learners working together .
af: die aktiwiteit laat die leerders hul vermo oefen om algemene kenmerke of eienskappe teidentifiseer maar help hulle ook om te verstaan dat leer binne 'n interafhanklike gemeenskap van leerders wat saamwerk kan plaasvind .

source: teachers are encouraged not to teach this activity but to facilitate discussion by asking probing questions and walking between groups to make sure everyone remains on task .
af: onderwysers word aangemoedig om nie die aktiwiteit te onderrig nie maar om die bespreking eerder te fassiliteer deur leidende vrae te vra en tussen die groepe te beweeg om seker te maak almal hou by die taak .

source: animals with endoskeletons all.. .
af: diere met endoskelette het almal.. .

source: write down two examples of mammals from the above pictures .
af: gee twee voorbeelde van soogdiere uit die foto's hierbo .

source: elephant and dog
af: olifant en hond

source: what type of bird is shown in the picture ?
af: watter soort vol word in die foto's gewys ?

source: a seagull
af: 'n seemeeu

source: give an example of a reptile .
af: gee 'n voorbeeld van 'n reptiel .

source: crocodile .
af: krokodil

source: let's take a look at the differences and similarities between exoskeletons and endoskeletons .
af: kom ons kyk nou na die verskille en ooreenkomste tussen ekso en endoskelette .

source: this extension activity is not required by the caps but is a good introduction to the following section on animal skeletons where the function of the skeleton is covered in great depth .
af: hierdie uitbreidingsaktiwiteit word nie deur die kabv vereis nie maar is 'n goeie inleiding tot die volgende afdeling oor skelette van diere waar die funksie van die skelet in fyn besonderhede behandel word .

source: examples of animals
af: voorbeelde van diere

source: position of the skeleton
af: posisie van die skelet

source: functions of the skeleton
af: funksies van die skelet

source: muscle attachment
af: spieraanhegting

source: joints
af: gewrigte

source: mode of movement
af: soort beweging

source: type of animal
af: soort dier

source: crab bee
af: krap by

source: lion human bird frog
af: leeu mens vol padda

source: position
af: posisie

source: outside the body
af: buite die liggaam

source: inside the body fluid filled
af: binne die liggaam

source: functions
af: funksies

source: protects prevents drying out supports
af: beskerm verhoed uitdroging ondersteun

source: protects soft organs support movement stores minerals in bones
af: beskerm sagte organe ondersteun beweging stoor minerale in beendere

source: attaches to inside of the exoskeleton parts
af: heg aan die binnekant van die eksoskelet

source: attaches by tendon onto the bones of the skeleton
af: heg met tendons aan die bene van die skelet

source: only hinge joints
af: slegs skarniergewrigte

source: various joints between the bones
af: verskillende soorte gewrigte tussen bene

source: walking jumping swinging flying
af: loop spring swaai vlieg

source: walking running jumping swinging swimming flying
af: loop hardloop spring swaai swem vlieg

source: match the type of habitat in the left column to the appropriate description in the right column by drawing a line between the correct pairs .
af: pas die tipe habitat uit die linkerkantste kolom by die beskrywing in die regterkantste kolom .

source: next to each habitat write an example of an animal and plant that live specifically in that kind of environment .
af: skryf 'n voorbeeld van 'n dier en 'n plant wat spesifiek in daardie omgewing aangetref sal word in die linkerkolom langs elke habitat neer .

source: example of a plant and animal that lives in this habitat
af: voorbeeld van 'n plant en 'n dier wat in hierdie habitat sal woon

source: forest
af: woud

source: even though the animals in this habitat can be the biggest on the planet some of these giants only eat tiny plants !
af: alhoewel die diere in hierdie habitat van die grootste op die planeet is eet sommige van hierdie reuse net klein plantjies !

source: desert
af: woestyn

source: many large mammals and other animals and a range of plants and big trees live here .
af: baie groot soogdiere en ander diere en 'n verskeidenheid plante en groot bome leef hier .

source: aquatic
af: akwaties

source: very few trees grow here even though the soil is fertile .
af: al is die grond vrugbaar groei hier baie min bome .

source: grassland
af: grasveld

source: very few plants grow here because water is not readily available .
af: hier groei baie min plante omdat water skaars is .

source: learners need to list appropriate animals preferably from those we studied in this chapter
af: leerders moet gepaste diere neerskryf verkieslik di wat ons in die hoofstuk bestudeer het .

source: write a short description of the interdependence of the honey badger the honey guide bird and the bees .
af: skryf 'n kort beskrywing van die interafhanklikheid van die ratel die heuningwyservol en die bye .

source: which animals benefit from this relationship and which do not ?
af: watter diere trek voordeel uit die verhouding en watter nie ?

source: the badger doesn't know where the bee hive is so it cannot get honey .
af: die ratel weet nie waar die byekorf is nie daarom kan hy nie heuning kry nie .

source: the honey bird knows where it is but it cannot get to the larvae inside the hive because the bees' stings will kill it .
af: die heuningwyser weet waar die korf is maar kan nie by die larwes binne in die korf kom nie omdat die bye hom sal doodsteek .

source: the badger has a thick skin that the bee stings cannot penetrate .
af: die ratel het 'n dik vel waardeur die bye nie kan steek nie .

source: the honey guide shows the badger where the honey is and the badger breaks open the hive eats the honey and leaves the larvae to the honey guide .
af: die heuningwyser wys die ratel waar die heuning is en die ratel breek die korf oop eet die heuning en los die larwes vir die heuningwyser .

source: the bees make honey which the birds feed off and the badger eats the bees' larvae .
af: die bye maak heuning wat die ratel eet en die vol eet die bye se larwes .

source: the bees do not benefit from this relationship .
af: die bye trek nie voordeel uit hierdie verhouding nie .

source: name the different types of skeletons .
af: noem die verskillende soorte skelette .

source: exoskeleton hydroskeleton and endoskeleton
af: eksoskelet hidroskelet endoskelet

source: grasshopper exoskeleton invertebrate
af: sprinkaan eksoskelet invertebraat

source: bluebottle hydroskeleton invertebrate
af: bloublasie hidroskelet invertebraat

source: cape sparrow endoskeleton vertebrate
af: kaapse mossie endoskelet vertebraat

source: tortoise endoskeleton vertebrate
af: skilpad endoskelet vertebraat

source: sea horse endoskeleton vertebrate
af: seeperdjie endoskelet vertebraat

source: frog endoskeleton vertebrate
af: padda endoskelet vertebraat

source: crab exoskeleton invertebrate
af: krap eksoskelet invertebraat

source: if possible stick old x rays on the windows before the class commences when they walk in it would make quite an impact as to the nature of the lesson .
af: indien moontlik plak ou x strale teen die klas se vensters voordat u met die les begin .

source: perhaps visit a local veterinary hospital and ask if they don't have old x rays that you could use .
af: wanneer die leerders instap moet hulle dadelik kan agterkom waaroor die les gaan .

source: if you have enough x rays covering the windows the light in the class should be dimmed which will lend an element of eerie fascination to the lesson .
af: u kan miskien die naaste dierehospitaal besoek en hoor of hulle nie x strale van diere het wat u kan gebruik nie .

source: you now know that all vertebrates have bones inside their bodies while invertebrates do not .
af: jy weet nou reeds dat alle vertebrate bene binne in hulle liggame het en ongewerweldes nie .

source: every time a vertebrate animal moves it uses its bones joints and muscles .
af: elke keer dat 'n gewerwelde dier beweeg gebruik hy sy bene gewrigte en spiere .

source: in this section we are going to study the bones joints and muscles that help vertebrates to move .
af: in hierdie afdeling gaan ons die bene gewrigte en spiere bestudeer wat 'n vertebraat help om te beweeg .

source: the skeleton song http www.youtube.com watch?v jpvuqj5nv6u
af: die skelet liedjie goo.gl spfw1

source: bones are hard and form a very strong frame structure to support and protect a vertebrate animal's body .
af: bene is hard en vorm 'n sterk raamwerk om die vertebraat se liggaam te ondersteun en te beskerm .

source: vertebrates all have similar kinds of bones some are much bigger than others but the basic structure of the bones are very similar .
af: alle werwelddiere het dieselfde soort bene sommiges is net groter as ander maar die basiese struktuur van die bene is baie dieselfde .

source: an adult human has an average of 206 bones in their body !
af: 'n volwasse persoon het gemiddels 206 bene in sy liggaam !

source: how many functions of the bones in the skeleton can you remember ?
af: hoeveel funksies van die bene van die skelet kan jy onthou ?

source: teachers must emphasise that learners cut only on the dotted lines .
af: onderwysers moet seker maak dat leerders slegs op die stippellyne sny .

source: this is a good activity to assess learner's fine motor spatial and hand eye coordination skills as this impacts many other areas where learners might battle in their schoolwork and might give teachers some idea as to the types of problems they experience and how they can address these .
af: dit is 'n goeie aktiwiteit om leerders se fyn motoriese ruimtelike en hand oog kordinasie te toets aangesien dit 'n invloed op soveel ander gebiede van hul skoolwerk mag h .

source: we suggest that teachers walk through the class and carefully observe learners during this activity and assist those who need their help .
af: dit kan vir onderwysers 'n idee gee van die soort probleme wat leerders het en hulle kan dan aan hierdie probleme aandag gee .

source: here are the words of a song that teaches you about bones .
af: hier is die woorde van 'n ou liedjie wat jou meer oor bene leer .

source: the chorus lines has been left out each time .
af: die koorgedeelte is elke keer uitgelaat .

source: your head bone's connected from your neck bone your neck bone's connected from your shoulder bone your shoulder bone's connected from your back bone
af: jou kopbeen is vas aan jou nekbeen jou nekbeen is vas aan jou skouerbeen jou skouerbeen is vas aan jou rugbeen

source: your back bone's connected from your hip bone your hip bone's connected from your thigh bone your thigh bone's connected from your knee bone
af: jou rugbeen is vas aan jou heupbeen jou heupbeen is vas aan jou dybeen jou dybeen is vas aan jou kniebeen

source: your knee bone's connected from your leg bone your leg bone's connected from your ankle bone your ankle bone's connected from your foot bone your foot bone's connected from your toe bone !
af: jou kniebeen is vas aan jou been been jou been been is vas aan jou enkelbeen jou enkelbeen is vas aan jou voetbeen jou voetbeen is vas aan jou toonbeen !

source: photocopy the bones puzzle sheet make enough copies for each learner .
af: fotokopieer die bene legkaart bladsy maak genoeg vir elke leerder .

source: the labels below are for the bone puzzle and also need to be photocopied for the learners to cut out and add to their completed bones puzzles .
af: die byskrifte hieronder is bedoel vir die bene legkaart en moet ook vir die leerders gefotokopieer word sodat hulle dit kan uitknip en gebruik om die legkaarte te voltooi .

source: skull
af: skedel

source: foot bones
af: voetbene

source: lower jaw bone
af: onderkaakbeen

source: thigh bone
af: dybeen

source: ankle bones
af: enkelbene

source: inner forearm
af: binne voorarmbeen

source: calf bone
af: kuitbeen

source: toe bones
af: toonbene

source: shin bone
af: skeenbeen

source: ribs
af: ribbe

source: backbone
af: ruggraat

source: wrist bones
af: polsbene

source: kneecaps
af: knieskywe

source: hip bone
af: heupbeen

source: finger bones
af: vingerbene

source: tail bone
af: stuitjiebeen

source: collar bone
af: sleutelbeen

source: hand bones
af: handbene

source: breast bone
af: borsbeen

source: arm bone
af: bo armbeen

source: outer forearm
af: buite voorarmbeen

source: teachers who feel industrious can enlarge this puzzle and make a life size version to hang or stick on the classroom door .
af: onderwysers wat fluks voel kan die legkaart vergroot en 'n lewensgrootte weergawe in die klas opplak .

source: add labels and stick a small box to the door for suggestions for a name for the skeleton .
af: voeg byskrifte by en verskaf 'n klein houer by die deur vir voorstelle vir 'n naam vir die skelet !

source: now that you know where all the bones in the body are you are probably wondering what exactly each bone's job is .
af: noudat jy weet waar al die bene in die liggaam is wonder jy waarskynlik wat elke been se doel is .

source: let's find out .
af: kom ons vind uit .

source: the human skeleton .
af: die menslike skelet

source: long bones
af: langbene

source: arms legs finger bones and feet bones
af: arms bene vingerbene en voetbene

source: short bones
af: kortbene

source: wrist and feet
af: pols en enkel

source: flat bones
af: platbene

source: hip bones skull sternum chest bone and shoulder blade; ribs are also considered flat bones
af: heupbene skedel sternum borsbeen en skouerblaaie; ribbe word ook as platbene beskou

source: irregular bones
af: onrelmatige bene

source: vertebrae backbone; jawbone
af: werwels ruggraat; kakebeen

source: cat skeleton
af: skelet van 'n kat

source: fish skeleton
af: skelet van 'n vis

source: frog skeleton
af: skelet van 'n padda

source: which of the animals is a mammal ?
af: watter van hierdie diere is 'n soogdier ?

source: cat
af: kat

source: which is an amphibian ?
af: watter een is 'n amfibir ?

source: frog
af: padda

source: now that you know how to identify the different kinds of bones in vertebrates let's take a closer look at the functions of some of these bones .
af: noudat jy weet hoe om verskillende bene in vertebrate te identifiseer kom ons kyk na die funksies van sommige van hierdie bene .

source: remind learners that we study the human skeleton as an example of a vertebrate but that most vertebrates share the same structure of the bones and that these bones' functions are similar .
af: herinner leerders daaraan dat ons die menslike skelet as 'n voorbeeld van 'n vertebraat bestudeer maar dat die meeste vertebrate dieselfde basiese beenstruktuur het en dat hulle bene soortgelyke funksies het .

source: the vertebrate skull is made up of different bones that grow together to form a protective box or shell structure .
af: vertebrate se skedel bestaan uit verskillende bene wat aanmekaargroei om 'n beskermende kas te vorm .

source: can you identify the animals that each of these skulls belong to ?
af: kan jy die diere waaraan elkeen van hierdie skedels behoort identifiseer ?

source: write the name in the space below each skull .
af: skryf die naam in die spasie onder elke skedel .

source: answer crocodile skull horse skull rhinoceros skull human skull .
af: antwoord krokodil perd renoster mens

source: a baby and an adult do not have the same amount of bones .
af: 'n baba en 'n volwassene het nie dieselfde aantal bene nie .

source: when a baby is born their skull bones are not joined .
af: die baba se skedelbene is nog nie by geboorte vergoei nie .

source: the bones can move over each other to allow the baby to go through the birth canal !
af: die individuele bene kan ten opsigte van mekaar beweeg terwyl die baba deur die geboortekanaal moet gaan !

source: after birth the skull bones start to grow together !
af: die skedelbene vergroei n geboorte geleidelik met mekaar !

source: compare the bones in the backbone of the giraffe below with that of the human above .
af: vergelyk die bene in die werwelkolom van die kameelperd hieronder met di van die mens hierbo .

source: what do you notice about the shape of the vertebrae in the neck and in the back of the giraffe and those of the human's neck and bones ?
af: wat let jy op in verband met die vorm van die werwels in die nek en die rug van die kameelperd en di van die mens se nek en rug ?

source: giraffe only have 7 vertebrae in their necks go ahead and count them .
af: kameelperde het slegs sewe werwels in hul nekke tel hulle maar .

source: that is exactly the same as in a human neck and almost all other mammals .
af: dit is presies dieselfde as in die mens se nek soos by alle ander soogdiere .

source: vertebrates have long curved bones around their chest .
af: werweldiere het lang gebo platbene wat ribbes genoem word .
